Управление_закупками/src/AccumulationRegisters/ОстатокПотребностиПоВнутреннимЗаказам/ОстатокПотребностиПоВнутреннимЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстатокПотребностиПоВнутреннимЗаказам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>ВнутреннийЗаказ</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительныеХарактеристикиНоменклатуры</name>
    <type>
      <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_закупками/src/AccumulationRegisters/ОстатокПотребностиПоВнутреннимЗаказам/Forms/ФормаСпискаПозицияПодробно/Module.bsl
#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") Тогда
		
		Если Параметры.Отбор.Свойство("ВнутреннийЗаказ") Тогда 	
			Список.Параметры.УстановитьЗначениеПараметра("ВнутреннийЗаказ", Параметры.Отбор.ВнутреннийЗаказ);
			ВнутреннийЗаказ = Параметры.Отбор.ВнутреннийЗаказ;
		КонецЕсли;
		
		Если Параметры.Отбор.Свойство("Номенклатура") Тогда 	
			Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", Параметры.Отбор.Номенклатура);
			Номенклатура = Параметры.Отбор.Номенклатура;
		КонецЕсли;
		
		Если Параметры.Отбор.Свойство("ДополнительныеХарактеристикиНоменклатуры") Тогда	
			Список.Параметры.УстановитьЗначениеПараметра("ДополнительныеХарактеристикиНоменклатуры", Параметры.Отбор.ДополнительныеХарактеристикиНоменклатуры);
			ДополнительныеХарактеристикиНоменклатуры = Параметры.Отбор.ДополнительныеХарактеристикиНоменклатуры;	
		КонецЕсли;
		
		Если Параметры.Отбор.Свойство("ЕдиницаИзмерения") Тогда	
			Список.Параметры.УстановитьЗначениеПараметра("ЕдиницаИзмерения", Параметры.Отбор.ЕдиницаИзмерения);
			ЕдиницаИзмерения = Параметры.Отбор.ЕдиницаИзмерения;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
